app/Controllers/Reporte.php

INSERT INTO `tb_reportes` (`rep_titulo`, `rep_descripcion`, `tip_id`, `niv_id`, `rep_latitud`, `rep_longitud`, `rep_imagen`, `rep_estado`, `rep_fecha`, `usu_id`) VALUES ('Prueba 02', 'Y ahora ', '1', '1', '-5.205213', '-80.638495', 'uploads/1763509287_c67ed1cd96ced2e85e91.jpg', 'pendiente', '2025-11-18', '1')
---
    public function guardar()
    {
        $modelo = new ReporteModel();
        $imagen = $this->request->getFile('rep_imagen');
        $nombreImagen = null;

        if ($imagen && $imagen->isValid()) {
            $nombreImagen = $imagen->getRandomName();
            $imagen->move(FCPATH . 'uploads', $nombreImagen);
        }

        $modelo->insert([
            'rep_titulo' => $this->request->getPost('rep_titulo'),
            'rep_descripcion' => $this->request->getPost('rep_descripcion'),
            'tip_id' => $this->request->getPost('rep_tipo'),
            'niv_id' => $this->request->getPost('rep_nivel'),
            'rep_latitud' => $this->request->getPost('rep_latitud'),
            'rep_longitud' => $this->request->getPost('rep_longitud'),
            'rep_imagen' => "uploads/".$nombreImagen,
            'rep_estado' => 'pendiente',
            'rep_fecha' => date('Y-m-d'),
            'usu_id' => session()->usuario->codusuario

        ]);