app/Models/ReporteModel.php

    public function contarPorEstado()
    {
        return $this->select('rep_estado, COUNT(*) as total')
                    ->groupBy('rep_estado')
                    ->findAll();
---
SELECT `rep_estado`, COUNT(*) as total
FROM `tb_reportes`
GROUP BY `rep_estado`